app/controllers/admin/orders_controller.rb

  def update
    if @order.update(order_params)
---
UPDATE `orders` SET `orders`.`amount` = 84.18629429029858, `orders`.`updated_at` = '2022-08-31 04:00:53.823032' WHERE `orders`.`id` = 14

  def find_order
    @order = Order.find_by id: params[:id]
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 86 LIMIT 1